/* Условие задачи:

Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

4 -> да
-3 -> нет
7 -> нет */

int x = 4; // -3, 7

Console.WriteLine(x % 2 == 0 ? "Да" : "Нет");

break
